
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РезультатЗапроса.Загрузить(ПолучитьЗначения());
	ДобавляемыеРеквизиты = Новый Массив;
	ИтоговаяСтрока = Новый РеквизитФормы("ИтоговаяСтрока",Новый ОписаниеТипов("Строка"));
	ДобавляемыеРеквизиты.Добавить(ИтоговаяСтрока);
	КомандаОбновить = Команды.Добавить("ПК_Обновить");
	КомандаОбновить.Заголовок = "Обновить данные";
	КомандаОбновить.Действие = "ОбновитьДанные";
	
	НоваяКнопка = Элементы.Добавить("Обновить", Тип("КнопкаФормы"));
	НоваяКнопка.ИмяКоманды = "ПК_Обновить";
	
	Для Каждого СтрокаРезультата Из РезультатЗапроса Цикл
		
		Имя = "ПУ_" + СокрЛП(СтрокаРезультата.КодПрибораУчета);
		НовыйРеквизит = Новый РеквизитФормы(Имя, Новый ОписаниеТипов("СправочникСсылка.ПриборыУчета"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("Оборот" + Имя, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,2)));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("СреднееЗначение" + Имя, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,2)));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("Процент" + Имя, Новый ОписаниеТипов("Строка"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Ресурс = Справочники.ТипыРесурсов.Выбрать();
	
	Пока Ресурс.Следующий() Цикл
		
		Группа = Элементы.Добавить("Группа" + СтрЗаменить(Ресурс.Наименование, " ", ""), Тип("ГруппаФормы"));
		Группа.Заголовок = Ресурс.Наименование;
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	КонецЦикла;
	
	ПредПриборУчета = Неопределено;
	
	Для каждого СтрокаРезультата Из РезультатЗапроса Цикл
		
		ИмяЭлемента = "ПУ_" + СокрЛП(СтрокаРезультата.КодПрибораУчета);
		ТипРесурса = Строка(СтрокаРезультата.ТипРесурса);
		
		Если НЕ СтрокаРезультата.ПриборУчета = ПредПриборУчета Тогда
			
			Группа = Элементы.Добавить("Группа" + ИмяЭлемента, Тип("ГруппаФормы"), Элементы["Группа" + ТипРесурса]);
			Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
		КонецЕсли;
		
		ЭтотОбъект[ИмяЭлемента] = СтрокаРезультата.ПриборУчета;
		ЭтотОбъект["Оборот" + ИмяЭлемента] = СтрокаРезультата.Оборот;
		ЭтотОбъект["СреднееЗначение" + ИмяЭлемента] = СтрокаРезультата.СреднееЗначение;
		ЭтотОбъект["Процент" + ИмяЭлемента] = Строка(СтрокаРезультата.Процент) + "%";
		
		НовыйЭлемент1 = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Группа);
		НовыйЭлемент1.ПутьКДанным = ИмяЭлемента;
		НовыйЭлемент1.Заголовок = "Прибор учета";
		
		НовыйЭлемент2 = Элементы.Добавить("Оборот" + ИмяЭлемента, Тип("ПолеФормы"), Группа);
		НовыйЭлемент2.ПутьКДанным = "Оборот" + ИмяЭлемента;
		НовыйЭлемент2.Заголовок = "Оборот";
		
		НовыйЭлемент3 = Элементы.Добавить("СреднееЗначение" + ИмяЭлемента, Тип("ПолеФормы"), Группа);
		НовыйЭлемент3.ПутьКДанным = "СреднееЗначение" + ИмяЭлемента;
		НовыйЭлемент3.Заголовок = "Среднее значение";
		
		НовыйЭлемент4 = Элементы.Добавить("Процент" + ИмяЭлемента, Тип("ПолеФормы"), Группа);
		НовыйЭлемент4.ПутьКДанным = "Процент" + ИмяЭлемента;
		НовыйЭлемент4.Заголовок = "Процент";
		
		Если СтрокаРезультата.Оборот < СтрокаРезультата.СреднееЗначение Тогда
			
			НовыйЭлемент2.ЦветТекста = WebЦвета.Зеленый;
			НовыйЭлемент4.ЦветТекста = WebЦвета.Зеленый;
			
		ИначеЕсли СтрокаРезультата.Оборот > СтрокаРезультата.СреднееЗначение Тогда
			
			НовыйЭлемент2.ЦветТекста = WebЦвета.Коралловый;
			НовыйЭлемент4.ЦветТекста = WebЦвета.Коралловый;
			
		КонецЕсли;
		
		ПредПриборУчета = СтрокаРезультата.ПриборУчета;
		
	КонецЦикла;
	
	ГруппаИтогов = Элементы.Добавить("ГруппаИтогов", Тип("ГруппаФормы"));
	ГруппаИтогов.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаИтогов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлементИтогов = Элементы.Добавить("ПоследниеПоказания", Тип("ПолеФормы"), ГруппаИтогов);
	НовыйЭлементИтогов.ПутьКДанным = ИтоговаяСтрока.Имя;
	НовыйЭлементИтогов.Заголовок = "Последние показания";
	НовыйЭлементИтогов.Шрифт = ШрифтыСтиля.ЗаголовокЧетвертогоУровня;
	
	СформироватьИтоговуюСтроку();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьИтоговуюСтроку()
	
	ПоследнийДень = ПолучитьДату();
	СекСутки = 86400; // Секунд в сутках
	День = Цел((НачалоДня(ТекущаяДатаСеанса()) - НачалоДня(ПоследнийДень)) / СекСутки);
	ЭтотОбъект.ИтоговаяСтрока = ?(
		ПоследнийДень = '00010101',
		"Нет показаний",
		"Прошло " + День + " дней с последней даты.");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДату()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	УчетПоказаний.Дата КАК Дата
	               |ИЗ
	               |	Документ.УчетПоказаний КАК УчетПоказаний
	               |ГДЕ
	               |	УчетПоказаний.Проведен = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат Результат[0].Дата;
	
КонецФункции

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	 ОбновитьДанныеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	Для каждого СтрокаРезультата Из РезультатЗапроса Цикл
		
		ИмяЭлемента = "ПУ_" + СокрЛП(СтрокаРезультата.КодПрибораУчета);
		
		ЭтотОбъект[ИмяЭлемента] = СтрокаРезультата.ПриборУчета;
		ЭтотОбъект[ИмяЭлемента].Заголовок = Строка(СтрокаРезультата.ПриборУчета);
		ЭтотОбъект["Оборот" + ИмяЭлемента] = СтрокаРезультата.Оборот;
		ЭтотОбъект["СреднееЗначение" + ИмяЭлемента] = СтрокаРезультата.СреднееЗначение;
		ЭтотОбъект["Процент" + ИмяЭлемента] = Строка(СтрокаРезультата.Процент) + "%";
		
		Если СтрокаРезультата.Оборот < СтрокаРезультата.СреднееЗначение Тогда
			
			Элементы["Оборот" + ИмяЭлемента].ЦветТекста = WebЦвета.Зеленый;
			Элементы["Процент" + ИмяЭлемента].ЦветТекста = WebЦвета.Зеленый;
			
		ИначеЕсли СтрокаРезультата.Оборот > СтрокаРезультата.СреднееЗначение Тогда
			
			Элементы["Оборот" + ИмяЭлемента].ЦветТекста = WebЦвета.Коралловый;
			Элементы["Процент" + ИмяЭлемента].ЦветТекста = WebЦвета.Коралловый;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьИтоговуюСтроку();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(ПоказанияСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ МаксимальныйПериод
	|ИЗ
	|	РегистрСведений.Показания.СрезПоследних КАК ПоказанияСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотреблениеРесурсовОбороты.ПриборУчета КАК ПриборУчета,
	|	СРЕДНЕЕ(ПотреблениеРесурсовОбороты.ПотреблениеРесурсаОборот) КАК СреднееЗначение
	|ПОМЕСТИТЬ СреднееЗаГод
	|ИЗ
	|	МаксимальныйПериод КАК МаксимальныйПериод
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПотреблениеРесурсов.Обороты(,, Месяц,) КАК ПотреблениеРесурсовОбороты
	|		ПО ПотреблениеРесурсовОбороты.Период МЕЖДУ НАЧАЛОПЕРИОДА(МаксимальныйПериод.Период, ГОД) И МаксимальныйПериод.Период
	|СГРУППИРОВАТЬ ПО
	|	ПотреблениеРесурсовОбороты.ПриборУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПотреблениеРесурсовОбороты.Период КАК Период,
	|	ПотреблениеРесурсовОбороты.ПриборУчета КАК ПриборУчета,
	|	ПотреблениеРесурсовОбороты.ПриборУчета.Код КАК КодПрибораУчета,
	|	ПотреблениеРесурсовОбороты.ПриборУчета.ВидРесурса.Тип КАК ТипРесурса,
	|	ПотреблениеРесурсовОбороты.ПотреблениеРесурсаОборот КАК Оборот,
	|	СреднееЗаГод.СреднееЗначение КАК СреднееЗначение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СреднееЗаГод.СреднееЗначение, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ПотреблениеРесурсовОбороты.ПотреблениеРесурсаОборот / СреднееЗаГод.СреднееЗначение * 100
	|	КОНЕЦ КАК Процент
	|ИЗ
	|	РегистрНакопления.ПотреблениеРесурсов.Обороты(,, Месяц,) КАК ПотреблениеРесурсовОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Показания.СрезПоследних КАК ПоказанияСрезПоследних
	|		ПО ПотреблениеРесурсовОбороты.Период = ПоказанияСрезПоследних.Период
	|		И ПотреблениеРесурсовОбороты.ПриборУчета = ПоказанияСрезПоследних.ПриборУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйПериод КАК МаксимальныйПериод
	|		ПО МаксимальныйПериод.Период = ПотреблениеРесурсовОбороты.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СреднееЗаГод КАК СреднееЗаГод
	|		ПО ПотреблениеРесурсовОбороты.ПриборУчета = СреднееЗаГод.ПриборУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПотреблениеРесурсовОбороты.ПриборУчета.ВидРесурса.Тип";
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

#КонецОбласти
