#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьУслугиПоНедвижимостиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НедвижимостьПриИзменении(Элемент)
	
	ЗаполнитьУслугиПоНедвижимостиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьУслугиПоНедвижимостиНаСервере()
	
	ПотреблениеЖКХ.ЗаполнитьУслугиПоНедвижимости(Объект);
	
КонецПроцедуры

#КонецОбласти
