
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Показания
	Движения.Показания.Записывать = Истина;
	
	Для Каждого ТекСтрокаПоказания Из Показания Цикл
		Движение = Движения.Показания.Добавить();
		Движение.Период = Дата;
		Движение.Недвижимость = Недвижимость;
		Движение.ПриборУчета = ТекСтрокаПоказания.ПриборУчета;
		Движение.Ресурс = ТекСтрокаПоказания.ПриборУчета.ВидРесурса;
		Движение.Показание = ТекСтрокаПоказания.ЗначениеУслуги;
	КонецЦикла;
	
	// регистр ПотреблениеРесурсов
	Движения.ПотреблениеРесурсов.Записывать = Истина;
	ВодоотведениеПотребление = 0;
	
	Для Каждого ТекСтрокаПотреблениеРесурсов Из Показания Цикл
		Движение = Движения.ПотреблениеРесурсов.Добавить();
		Движение.Период = Дата;
		Движение.ПриборУчета = ТекСтрокаПотреблениеРесурсов.ПриборУчета;
		
		ПредыдущееЗначениеУслуги = ПолучитьПредыдущееЗначениеУслуги(ТекСтрокаПотреблениеРесурсов.ПриборУчета, Дата);
		
		Если ПредыдущееЗначениеУслуги = Неопределено Тогда
			
			Движение.ПотреблениеРесурса = 0;
			
		Иначе
			
			Движение.ПотреблениеРесурса = ТекСтрокаПотреблениеРесурсов.ЗначениеУслуги - ПредыдущееЗначениеУслуги;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПредыдущееЗначениеУслуги(Прибор, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоказанияСрезПоследних.Показание КАК Показание
	|ИЗ
	|	РегистрСведений.Показания.СрезПоследних(ДобавитьКДате(&Дата, МЕСЯЦ, -1), ПриборУчета = &ПриборУчета) КАК ПоказанияСрезПоследних";
	
	// Установка значений параметров
	Запрос.УстановитьПараметр("ПриборУчета", Прибор);
	Запрос.УстановитьПараметр("Дата", Дата);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		Возврат РезультатЗапроса[0].Показание;
		
	КонецЕсли;
	
КонецФункции
