
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Показания
	Движения.Показания.Записывать = Истина;
	
	Для Каждого ТекСтрокаПоказания Из Показания Цикл
		Движение = Движения.Показания.Добавить();
		Движение.Период = Дата;
		Движение.Недвижимость = Недвижимость;
		Движение.ПриборУчета = ТекСтрокаПоказания.ПриборУчета;
		Движение.Ресурс = ТекСтрокаПоказания.ПриборУчета.ВидРесурса;
		Движение.Показание = ТекСтрокаПоказания.ЗначениеУслуги;
	КонецЦикла;
	
	// регистр ПотреблениеРесурсов
	Движения.ПотреблениеРесурсов.Записывать = Истина;
//	ВодоотведениеПотребление = 0;
	ПредыдущиеЗначенияУслуг = ПолучитьПредыдущееЗначениеУслуги(Показания.ВыгрузитьКолонку("ПриборУчета"), Дата);
	
	Для Каждого ТекСтрокаПотреблениеРесурсов Из Показания Цикл
		Движение = Движения.ПотреблениеРесурсов.Добавить();
		Движение.Период = Дата;
		Движение.ПриборУчета = ТекСтрокаПотреблениеРесурсов.ПриборУчета;
		
		ПредыдущееЗначениеУслуги = ПредыдущиеЗначенияУслуг[ТекСтрокаПотреблениеРесурсов.ПриборУчета];
		
		Если ПредыдущееЗначениеУслуги = Неопределено Тогда
			
			Движение.ПотреблениеРесурса = 0;
			
		Иначе
			
			Движение.ПотреблениеРесурса = ТекСтрокаПотреблениеРесурсов.ЗначениеУслуги - ПредыдущееЗначениеУслуги;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПредыдущееЗначениеУслуги(ПриборыУчета, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоказанияСрезПоследних.ПриборУчета КАК ПриборУчета,
	|	ПоказанияСрезПоследних.Показание КАК Показание
	|ИЗ
	|	РегистрСведений.Показания.СрезПоследних(ДобавитьКДате(&Дата, МЕСЯЦ, -1), ПриборУчета В (&ПриборыУчета)) КАК ПоказанияСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ПриборыУчета", ПриборыУчета);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ПредыдущиеЗначения = Новый Соответствие;
	Для Каждого СтрокаРезультата Из РезультатЗапроса Цикл
		ПредыдущиеЗначения.Вставить(СтрокаРезультата.ПриборУчета, СтрокаРезультата.Показание);
	КонецЦикла;
	
	Возврат ПредыдущиеЗначения;
	
КонецФункции

#КонецОбласти
